Ran Plan for project: `infrastructure` dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # kubernetes_manifest.prestashop_app will be created
+ resource "kubernetes_manifest" "prestashop_app" {
      + manifest = {
          + apiVersion = "argoproj.io/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + name      = "prestashop"
              + namespace = "argocd"
            }
          + spec       = {
              + destination = {
                  + namespace = "prestashop"
                  + server    = "https://kubernetes.default.svc"
                }
              + project     = "default"
              + source      = {
                  + path           = "apps/prestashop"
                  + repoURL        = "https://github.com/umarkhaliq-hash/atlantis-ngrok"
                  + targetRevision = "HEAD"
                }
            }
        }
      + object   = {
          + apiVersion = "argoproj.io/v1alpha1"
          + kind       = "Application"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "prestashop"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + operation  = {
              + info        = (known after apply)
              + initiatedBy = {
                  + automated = (known after apply)
                  + username  = (known after apply)
                }
              + retry       = {
                  + backoff = {
                      + duration    = (known after apply)
                      + factor      = (known after apply)
                      + maxDuration = (known after apply)
                    }
                  + limit   = (known after apply)
                  + refresh = (known after apply)
                }
              + sync        = {
                  + autoHealAttemptsCount = (known after apply)
                  + dryRun                = (known after apply)
                  + manifests             = (known after apply)
                  + prune                 = (known after apply)
                  + resources             = (known after apply)
                  + revision              = (known after apply)
                  + revisions             = (known after apply)
                  + source                = {
                      + chart          = (known after apply)
                      + directory      = {
                          + exclude = (known after apply)
                          + include = (known after apply)
                          + jsonnet = {
                              + extVars = (known after apply)
                              + libs    = (known after apply)
                              + tlas    = (known after apply)
                            }
                          + recurse = (known after apply)
                        }
                      + helm           = {
                          + apiVersions             = (known after apply)
                          + fileParameters          = (known after apply)
                          + ignoreMissingValueFiles = (known after apply)
                          + kubeVersion             = (known after apply)
                          + namespace               = (known after apply)
                          + parameters              = (known after apply)
                          + passCredentials         = (known after apply)
                          + releaseName             = (known after apply)
                          + skipCrds                = (known after apply)
                          + skipSchemaValidation    = (known after apply)
                          + skipTests               = (known after apply)
                          + valueFiles              = (known after apply)
                          + values                  = (known after apply)
                          + valuesObject            = (known after apply)
                          + version                 = (known after apply)
                        }
                      + kustomize      = {
                          + apiVersions               = (known after apply)
                          + commonAnnotations         = (known after apply)
                          + commonAnnotationsEnvsubst = (known after apply)
                          + commonLabels              = (known after apply)
                          + components                = (known after apply)
                          + forceCommonAnnotations    = (known after apply)
                          + forceCommonLabels         = (known after apply)
                          + ignoreMissingComponents   = (known after apply)
                          + images                    = (known after apply)
                          + kubeVersion               = (known after apply)
                          + labelIncludeTemplates     = (known after apply)
                          + labelWithoutSelector      = (known after apply)
                          + namePrefix                = (known after apply)
                          + nameSuffix                = (known after apply)
                          + namespace                 = (known after apply)
                          + patches                   = (known after apply)
                          + replicas                  = (known after apply)
                          + version                   = (known after apply)
                        }
                      + name           = (known after apply)
                      + path           = (known after apply)
                      + plugin         = {
                          + env        = (known after apply)
                          + name       = (known after apply)
                          + parameters = (known after apply)
                        }
                      + ref            = (known after apply)
                      + repoURL        = (known after apply)
                      + targetRevision = (known after apply)
                    }
                  + sources               = (known after apply)
                  + syncOptions           = (known after apply)
                  + syncStrategy          = {
                      + apply = {
                          + force = (known after apply)
                        }
                      + hook  = {
                          + force = (known after apply)
                        }
                    }
                }
            }
          + spec       = {
              + destination          = {
                  + name      = (known after apply)
                  + namespace = "prestashop"
                  + server    = "https://kubernetes.default.svc"
                }
              + ignoreDifferences    = (known after apply)
              + info                 = (known after apply)
              + project              = "default"
              + revisionHistoryLimit = (known after apply)
              + source               = {
                  + chart          = (known after apply)
                  + directory      = {
                      + exclude = (known after apply)
                      + include = (known after apply)
                      + jsonnet = {
                          + extVars = (known after apply)
                          + libs    = (known after apply)
                          + tlas    = (known after apply)
                        }
                      + recurse = (known after apply)
                    }
                  + helm           = {
                      + apiVersions             = (known after apply)
                      + fileParameters          = (known after apply)
                      + ignoreMissingValueFiles = (known after apply)
                      + kubeVersion             = (known after apply)
                      + namespace               = (known after apply)
                      + parameters              = (known after apply)
                      + passCredentials         = (known after apply)
                      + releaseName             = (known after apply)
                      + skipCrds                = (known after apply)
                      + skipSchemaValidation    = (known after apply)
                      + skipTests               = (known after apply)
                      + valueFiles              = (known after apply)
                      + values                  = (known after apply)
                      + valuesObject            = (known after apply)
                      + version                 = (known after apply)
                    }
                  + kustomize      = {
                      + apiVersions               = (known after apply)
                      + commonAnnotations         = (known after apply)
                      + commonAnnotationsEnvsubst = (known after apply)
                      + commonLabels              = (known after apply)
                      + components                = (known after apply)
                      + forceCommonAnnotations    = (known after apply)
                      + forceCommonLabels         = (known after apply)
                      + ignoreMissingComponents   = (known after apply)
                      + images                    = (known after apply)
                      + kubeVersion               = (known after apply)
                      + labelIncludeTemplates     = (known after apply)
                      + labelWithoutSelector      = (known after apply)
                      + namePrefix                = (known after apply)
                      + nameSuffix                = (known after apply)
                      + namespace                 = (known after apply)
                      + patches                   = (known after apply)
                      + replicas                  = (known after apply)
                      + version                   = (known after apply)
                    }
                  + name           = (known after apply)
                  + path           = "apps/prestashop"
                  + plugin         = {
                      + env        = (known after apply)
                      + name       = (known after apply)
                      + parameters = (known after apply)
                    }
                  + ref            = (known after apply)
                  + repoURL        = "https://github.com/umarkhaliq-hash/atlantis-ngrok"
                  + targetRevision = "HEAD"
                }
              + sourceHydrator       = {
                  + drySource  = {
                      + path           = (known after apply)
                      + repoURL        = (known after apply)
                      + targetRevision = (known after apply)
                    }
                  + hydrateTo  = {
                      + targetBranch = (known after apply)
                    }
                  + syncSource = {
                      + path         = (known after apply)
                      + targetBranch = (known after apply)
                    }
                }
              + sources              = (known after apply)
              + syncPolicy           = {
                  + automated                = {
                      + allowEmpty = (known after apply)
                      + enabled    = (known after apply)
                      + prune      = (known after apply)
                      + selfHeal   = (known after apply)
                    }
                  + managedNamespaceMetadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  + retry                    = {
                      + backoff = {
                          + duration    = (known after apply)
                          + factor      = (known after apply)
                          + maxDuration = (known after apply)
                        }
                      + limit   = (known after apply)
                      + refresh = (known after apply)
                    }
                  + syncOptions              = (known after apply)
                }
            }
        }
    }

  # kubernetes_namespace.argocd will be created
+ resource "kubernetes_namespace" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ argocd_namespace = "argocd"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://subacetabular-overindulgently-cullen.ngrok-free.dev/lock?id=umarkhaliq-hash%252Fatlantis-ngrok%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p infrastructure
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```